src/test/request_user.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ss="http://net.da.net.soapservice">
    <soapenv:Header/>
    <soapenv:Body>
        <ss:getUserRequest>
            <ss:login>Pat</ss:login>
        </ss:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>